#!/usr/bin/env python
# -*- coding: utf-8 -*-

# Есть словарь магазинов с распродажами

shops = {
    'ашан':
        [
            {'name': 'печенье', 'price': 10.99},
            {'name': 'конфеты', 'price': 34.99},
            {'name': 'карамель', 'price': 45.99},
            {'name': 'пирожное', 'price': 67.99}
        ],
    'пятерочка':
        [
            {'name': 'печенье', 'price': 9.99},
            {'name': 'конфеты', 'price': 32.99},
            {'name': 'карамель', 'price': 46.99},
            {'name': 'пирожное', 'price': 59.99}
        ],
    'магнит':
        [
            {'name': 'печенье', 'price': 11.99},
            {'name': 'конфеты', 'price': 30.99},
            {'name': 'карамель', 'price': 41.99},
            {'name': 'пирожное', 'price': 62.99}
        ],
}

# Создайте словарь цен на продкты следующего вида (писать прямо в коде)
sweets = {
    'печенье': [
        {'shop': 'Ашан', 'price': 10.99},
        {'shop': 'Пятерочка', 'price': 9.99},
        {'shop': 'Магнит', 'price': 11.99},
    ],
    'конфеты':  [
        {'shop': 'Ашан', 'price': 34.99},
        {'shop': 'Пятерочка', 'price': 32.99},
        {'shop': 'Магнит', 'price': 30.99},
    ],
    'карамель':[
        {'shop': 'Ашан', 'price': 34.99},
        {'shop': 'Пятерочка', 'price': 32.99},
        {'shop': 'Магнит', 'price': 30.99},
    ],
    'пироженные':[
        {'shop': 'Ашан', 'price': 45.99},
        {'shop': 'Пятерочка', 'price': 46.99},
        {'shop': 'Магнит', 'price': 41.99},
    ],
'карамель':[
        {'shop': 'Ашан', 'price': 67.99},
        {'shop': 'Пятерочка', 'price': 69.99},
        {'shop': 'Магнит', 'price': 52.99},
    ]
}
print(sweets)

